# Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y).

print("Введите координаты точки:")
quarter = float(input("q = "))

if quarter == 1:
    print(q "X = {p_inf} Y = {p_inf}")

